MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2048ECM124/mcu.h
extern volatile __LATBbits_t LATBbits __asm__ ("LATB") __attribute__((section("sfrs"), address(0xBF860130)));
extern volatile uint32_t        LATBCLR __attribute__((section("sfrs"),address(0xBF860134)));
extern volatile uint32_t        LATBSET __attribute__((section("sfrs"),address(0xBF860138)));
extern volatile uint32_t        LATBINV __attribute__((section("sfrs"),address(0xBF86013C)));
#define ODCB ODCB
extern volatile uint32_t   ODCB __attribute__((section("sfrs"), address(0xBF860140)));
typedef union {
  struct {
    uint32_t ODCB0:1;
    uint32_t ODCB1:1;
    uint32_t ODCB2:1;
    uint32_t ODCB3:1;
    uint32_t ODCB4:1;
    uint32_t ODCB5:1;
    uint32_t ODCB6:1;
    uint32_t ODCB7:1;
    uint32_t ODCB8:1;
    uint32_t ODCB9:1;
    uint32_t ODCB10:1;
    uint32_t ODCB11:1;
    uint32_t ODCB12:1;
    uint32_t ODCB13:1;
    uint32_t ODCB14:1;
    uint32_t ODCB15:1;
  };
  struct {
    uint32_t w:32;
  };
} __ODCBbits_t;
extern volatile __ODCBbits_t ODCBbits __asm__ ("ODCB") __attribute__((section("sfrs"), address(0xBF860140)));
extern volatile uint32_t        ODCBCLR __attribute__((section("sfrs"),address(0xBF860144)));
extern volatile uint32_t        ODCBSET __attribute__((section("sfrs"),address(0xBF860148)));
extern volatile uint32_t        ODCBINV __attribute__((section("sfrs"),address(0xBF86014C)));
#define CNPUB CNPUB
extern volatile uint32_t   CNPUB __attribute__((section("sfrs"), address(0xBF860150)));
typedef union {
  struct {
    uint32_t CNPUB0:1;
    uint32_t CNPUB1:1;
    uint32_t CNPUB2:1;
    uint32_t CNPUB3:1;
    uint32_t CNPUB4:1;
    uint32_t CNPUB5:1;
    uint32_t CNPUB6:1;
    uint32_t CNPUB7:1;
    uint32_t CNPUB8:1;
    uint32_t CNPUB9:1;
    uint32_t CNPUB10:1;
    uint32_t CNPUB11:1;
    uint32_t CNPUB12:1;
    uint32_t CNPUB13:1;
    uint32_t CNPUB14:1;
    uint32_t CNPUB15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNPUBbits_t;
extern volatile __CNPUBbits_t CNPUBbits __asm__ ("CNPUB") __attribute__((section("sfrs"), address(0xBF860150)));
extern volatile uint32_t        CNPUBCLR __attribute__((section("sfrs"),address(0xBF860154)));
extern volatile uint32_t        CNPUBSET __attribute__((section("sfrs"),address(0xBF860158)));
extern volatile uint32_t        CNPUBINV __attribute__((section("sfrs"),address(0xBF86015C)));
#define CNPDB CNPDB
extern volatile uint32_t   CNPDB __attribute__((section("sfrs"), address(0xBF860160)));
typedef union {
  struct {
    uint32_t CNPDB0:1;
    uint32_t CNPDB1:1;
    uint32_t CNPDB2:1;
    uint32_t CNPDB3:1;
    uint32_t CNPDB4:1;
    uint32_t CNPDB5:1;
    uint32_t CNPDB6:1;
    uint32_t CNPDB7:1;
    uint32_t CNPDB8:1;
    uint32_t CNPDB9:1;
    uint32_t CNPDB10:1;
    uint32_t CNPDB11:1;
    uint32_t CNPDB12:1;
    uint32_t CNPDB13:1;
    uint32_t CNPDB14:1;
    uint32_t CNPDB15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNPDBbits_t;
extern volatile __CNPDBbits_t CNPDBbits __asm__ ("CNPDB") __attribute__((section("sfrs"), address(0xBF860160)));
extern volatile uint32_t        CNPDBCLR __attribute__((section("sfrs"),address(0xBF860164)));
extern volatile uint32_t        CNPDBSET __attribute__((section("sfrs"),address(0xBF860168)));
extern volatile uint32_t        CNPDBINV __attribute__((section("sfrs"),address(0xBF86016C)));
#define CNCONB CNCONB
extern volatile uint32_t   CNCONB __attribute__((section("sfrs"), address(0xBF860170)));
typedef union {
  struct {
    uint32_t :13;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNCONBbits_t;
extern volatile __CNCONBbits_t CNCONBbits __asm__ ("CNCONB") __attribute__((section("sfrs"), address(0xBF860170)));
extern volatile uint32_t        CNCONBCLR __attribute__((section("sfrs"),address(0xBF860174)));
extern volatile uint32_t        CNCONBSET __attribute__((section("sfrs"),address(0xBF860178)));
extern volatile uint32_t        CNCONBINV __attribute__((section("sfrs"),address(0xBF86017C)));
#define CNENB CNENB
extern volatile uint32_t   CNENB __attribute__((section("sfrs"), address(0xBF860180)));
typedef union {
  struct {
    uint32_t CNIEB0:1;
    uint32_t CNIEB1:1;
    uint32_t CNIEB2:1;
    uint32_t CNIEB3:1;
    uint32_t CNIEB4:1;
    uint32_t CNIEB5:1;
    uint32_t CNIEB6:1;
    uint32_t CNIEB7:1;
    uint32_t CNIEB8:1;
    uint32_t CNIEB9:1;
    uint32_t CNIEB10:1;
    uint32_t CNIEB11:1;
    uint32_t CNIEB12:1;
    uint32_t CNIEB13:1;
    uint32_t CNIEB14:1;
    uint32_t CNIEB15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNENBbits_t;
extern volatile __CNENBbits_t CNENBbits __asm__ ("CNENB") __attribute__((section("sfrs"), address(0xBF860180)));
extern volatile uint32_t        CNENBCLR __attribute__((section("sfrs"),address(0xBF860184)));
extern volatile uint32_t        CNENBSET __attribute__((section("sfrs"),address(0xBF860188)));
extern volatile uint32_t        CNENBINV __attribute__((section("sfrs"),address(0xBF86018C)));
#define CNSTATB CNSTATB
extern volatile uint32_t   CNSTATB __attribute__((section("sfrs"), address(0xBF860190)));
typedef union {
  struct {
    uint32_t CNSTATB0:1;
    uint32_t CNSTATB1:1;
    uint32_t CNSTATB2:1;
    uint32_t CNSTATB3:1;
    uint32_t CNSTATB4:1;
    uint32_t CNSTATB5:1;
    uint32_t CNSTATB6:1;
    uint32_t CNSTATB7:1;
    uint32_t CNSTATB8:1;
    uint32_t CNSTATB9:1;
    uint32_t CNSTATB10:1;
    uint32_t CNSTATB11:1;
    uint32_t CNSTATB12:1;
    uint32_t CNSTATB13:1;
    uint32_t CNSTATB14:1;
    uint32_t CNSTATB15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNSTATBbits_t;
extern volatile __CNSTATBbits_t CNSTATBbits __asm__ ("CNSTATB") __attribute__((section("sfrs"), address(0xBF860190)));
extern volatile uint32_t        CNSTATBCLR __attribute__((section("sfrs"),address(0xBF860194)));
extern volatile uint32_t        CNSTATBSET __attribute__((section("sfrs"),address(0xBF860198)));
extern volatile uint32_t        CNSTATBINV __attribute__((section("sfrs"),address(0xBF86019C)));
#define ANSELC ANSELC
extern volatile uint32_t   ANSELC __attribute__((section("sfrs"), address(0xBF860200)));
typedef union {
  struct {
    uint32_t :1;
    uint32_t ANSC1:1;
    uint32_t ANSC2:1;
    uint32_t ANSC3:1;
    uint32_t ANSC4:1;
  };
  struct {
    uint32_t w:32;
  };
} __ANSELCbits_t;
