MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2048ECM124/mcu.h
#define _IPC23_AD1D34IP_POSITION                 0x0000000A
#define _IPC23_AD1D34IP_MASK                     0x00001C00
#define _IPC23_AD1D34IP_LENGTH                   0x00000003

#define _IPC23_AD1D35IS_POSITION                 0x00000010
#define _IPC23_AD1D35IS_MASK                     0x00030000
#define _IPC23_AD1D35IS_LENGTH                   0x00000002

#define _IPC23_AD1D35IP_POSITION                 0x00000012
#define _IPC23_AD1D35IP_MASK                     0x001C0000
#define _IPC23_AD1D35IP_LENGTH                   0x00000003

#define _IPC23_AD1D36IS_POSITION                 0x00000018
#define _IPC23_AD1D36IS_MASK                     0x03000000
#define _IPC23_AD1D36IS_LENGTH                   0x00000002

#define _IPC23_AD1D36IP_POSITION                 0x0000001A
#define _IPC23_AD1D36IP_MASK                     0x1C000000
#define _IPC23_AD1D36IP_LENGTH                   0x00000003

#define _IPC23_w_POSITION                        0x00000000
#define _IPC23_w_MASK                            0xFFFFFFFF
#define _IPC23_w_LENGTH                          0x00000020

#define _IPC24_AD1D37IS_POSITION                 0x00000000
#define _IPC24_AD1D37IS_MASK                     0x00000003
#define _IPC24_AD1D37IS_LENGTH                   0x00000002

#define _IPC24_AD1D37IP_POSITION                 0x00000002
#define _IPC24_AD1D37IP_MASK                     0x0000001C
#define _IPC24_AD1D37IP_LENGTH                   0x00000003

#define _IPC24_AD1D38IS_POSITION                 0x00000008
#define _IPC24_AD1D38IS_MASK                     0x00000300
#define _IPC24_AD1D38IS_LENGTH                   0x00000002

#define _IPC24_AD1D38IP_POSITION                 0x0000000A
#define _IPC24_AD1D38IP_MASK                     0x00001C00
#define _IPC24_AD1D38IP_LENGTH                   0x00000003

#define _IPC24_AD1D39IS_POSITION                 0x00000010
#define _IPC24_AD1D39IS_MASK                     0x00030000
#define _IPC24_AD1D39IS_LENGTH                   0x00000002

#define _IPC24_AD1D39IP_POSITION                 0x00000012
#define _IPC24_AD1D39IP_MASK                     0x001C0000
#define _IPC24_AD1D39IP_LENGTH                   0x00000003

#define _IPC24_AD1D40IS_POSITION                 0x00000018
#define _IPC24_AD1D40IS_MASK                     0x03000000
#define _IPC24_AD1D40IS_LENGTH                   0x00000002

#define _IPC24_AD1D40IP_POSITION                 0x0000001A
#define _IPC24_AD1D40IP_MASK                     0x1C000000
#define _IPC24_AD1D40IP_LENGTH                   0x00000003

#define _IPC24_w_POSITION                        0x00000000
#define _IPC24_w_MASK                            0xFFFFFFFF
#define _IPC24_w_LENGTH                          0x00000020

#define _IPC25_AD1D41IS_POSITION                 0x00000000
#define _IPC25_AD1D41IS_MASK                     0x00000003
#define _IPC25_AD1D41IS_LENGTH                   0x00000002

#define _IPC25_AD1D41IP_POSITION                 0x00000002
#define _IPC25_AD1D41IP_MASK                     0x0000001C
#define _IPC25_AD1D41IP_LENGTH                   0x00000003

#define _IPC25_AD1D42IS_POSITION                 0x00000008
#define _IPC25_AD1D42IS_MASK                     0x00000300
#define _IPC25_AD1D42IS_LENGTH                   0x00000002

#define _IPC25_AD1D42IP_POSITION                 0x0000000A
#define _IPC25_AD1D42IP_MASK                     0x00001C00
#define _IPC25_AD1D42IP_LENGTH                   0x00000003

#define _IPC25_AD1D43IS_POSITION                 0x00000010
#define _IPC25_AD1D43IS_MASK                     0x00030000
#define _IPC25_AD1D43IS_LENGTH                   0x00000002

#define _IPC25_AD1D43IP_POSITION                 0x00000012
#define _IPC25_AD1D43IP_MASK                     0x001C0000
#define _IPC25_AD1D43IP_LENGTH                   0x00000003

#define _IPC25_AD1D44IS_POSITION                 0x00000018
#define _IPC25_AD1D44IS_MASK                     0x03000000
#define _IPC25_AD1D44IS_LENGTH                   0x00000002

#define _IPC25_AD1D44IP_POSITION                 0x0000001A
#define _IPC25_AD1D44IP_MASK                     0x1C000000
#define _IPC25_AD1D44IP_LENGTH                   0x00000003

#define _IPC25_w_POSITION                        0x00000000
#define _IPC25_w_MASK                            0xFFFFFFFF
#define _IPC25_w_LENGTH                          0x00000020

#define _IPC26_CPCIS_POSITION                    0x00000000
#define _IPC26_CPCIS_MASK                        0x00000003
#define _IPC26_CPCIS_LENGTH                      0x00000002

#define _IPC26_CPCIP_POSITION                    0x00000002
#define _IPC26_CPCIP_MASK                        0x0000001C
#define _IPC26_CPCIP_LENGTH                      0x00000003

#define _IPC26_CFDCIS_POSITION                   0x00000008
#define _IPC26_CFDCIS_MASK                       0x00000300
#define _IPC26_CFDCIS_LENGTH                     0x00000002

#define _IPC26_CFDCIP_POSITION                   0x0000000A
#define _IPC26_CFDCIP_MASK                       0x00001C00
#define _IPC26_CFDCIP_LENGTH                     0x00000003

#define _IPC26_SBIS_POSITION                     0x00000010
#define _IPC26_SBIS_MASK                         0x00030000
#define _IPC26_SBIS_LENGTH                       0x00000002

#define _IPC26_SBIP_POSITION                     0x00000012
#define _IPC26_SBIP_MASK                         0x001C0000
#define _IPC26_SBIP_LENGTH                       0x00000003

#define _IPC26_CRPTIS_POSITION                   0x00000018
#define _IPC26_CRPTIS_MASK                       0x03000000
#define _IPC26_CRPTIS_LENGTH                     0x00000002

#define _IPC26_CRPTIP_POSITION                   0x0000001A
#define _IPC26_CRPTIP_MASK                       0x1C000000
#define _IPC26_CRPTIP_LENGTH                     0x00000003

#define _IPC26_w_POSITION                        0x00000000
#define _IPC26_w_MASK                            0xFFFFFFFF
#define _IPC26_w_LENGTH                          0x00000020

#define _IPC27_SPI1EIS_POSITION                  0x00000008
#define _IPC27_SPI1EIS_MASK                      0x00000300
#define _IPC27_SPI1EIS_LENGTH                    0x00000002

#define _IPC27_SPI1EIP_POSITION                  0x0000000A
#define _IPC27_SPI1EIP_MASK                      0x00001C00
#define _IPC27_SPI1EIP_LENGTH                    0x00000003

#define _IPC27_SPI1RXIS_POSITION                 0x00000010
#define _IPC27_SPI1RXIS_MASK                     0x00030000
#define _IPC27_SPI1RXIS_LENGTH                   0x00000002

#define _IPC27_SPI1RXIP_POSITION                 0x00000012
#define _IPC27_SPI1RXIP_MASK                     0x001C0000
#define _IPC27_SPI1RXIP_LENGTH                   0x00000003

#define _IPC27_SPI1TXIS_POSITION                 0x00000018
#define _IPC27_SPI1TXIS_MASK                     0x03000000
#define _IPC27_SPI1TXIS_LENGTH                   0x00000002

#define _IPC27_SPI1TXIP_POSITION                 0x0000001A
#define _IPC27_SPI1TXIP_MASK                     0x1C000000
#define _IPC27_SPI1TXIP_LENGTH                   0x00000003

#define _IPC27_w_POSITION                        0x00000000
#define _IPC27_w_MASK                            0xFFFFFFFF
#define _IPC27_w_LENGTH                          0x00000020

#define _IPC28_U1EIS_POSITION                    0x00000000
#define _IPC28_U1EIS_MASK                        0x00000003
#define _IPC28_U1EIS_LENGTH                      0x00000002

#define _IPC28_U1EIP_POSITION                    0x00000002
#define _IPC28_U1EIP_MASK                        0x0000001C
#define _IPC28_U1EIP_LENGTH                      0x00000003

#define _IPC28_U1RXIS_POSITION                   0x00000008
#define _IPC28_U1RXIS_MASK                       0x00000300
#define _IPC28_U1RXIS_LENGTH                     0x00000002

#define _IPC28_U1RXIP_POSITION                   0x0000000A
#define _IPC28_U1RXIP_MASK                       0x00001C00
#define _IPC28_U1RXIP_LENGTH                     0x00000003

